validation-evidence/aims-overhead-v2-20260805/no_tracing-20260805T093125Z/wrk-3.txt
Running 30s test @ http://10.103.205.176/api/products/
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   152.58ms   94.08ms 651.58ms   74.56%
    Req/Sec    27.85     11.85    60.00     57.46%
  Latency Distribution
     50%  131.42ms
     75%  191.63ms
     90%  288.09ms
     99%  484.97ms
  1642 requests in 30.07s, 77.43MB read
Requests/sec:     54.61
Transfer/sec:      2.58MB

STDERR